#include "Header.h"

//연습문제 1) 숫자 하나를 입력받고, 화면에 "양수" 또는 "음수" 를 출력하는 프로그램 코드를 작성하시오

int main()
{
	/*int number;
	scanf("%d", &number);

	if (number > 0)
	{
		printf("양수");
	}
	else if (number < 0)
	{
		printf("음수");
	}
	else
	{
		printf("0");
	}

	if (number > 0)
	{
		printf("양수");
	}
	else if (number == 0)
	{
		printf("0");
	}
	else
	{
		printf("음수");
	}*/
	
	//연습 문제2) 과제 표준에 따라서 근로 소득세 계산하시오
	//표준은 다음과 같다
	//1200만원 이하		세율 6%
	//1,200만원 초과 ~ 4600만원 이하 세율 15%
	//4600 ~ 8800만원 세율 24%
	//조건) 사용자는 본인의 소득액을 작성(만원단위로 입력)
	//출력예시
	//2024년 소득액을 작성해주세요(만원 단위) >> 1200
	//세율은 6%입니다
	//지불하실 세금은 72(만원)입니다.

	//문제풀이
	//1. 변수로 어떤 값을 사용할 지를 구분
	//	소득액, 세율, 세금 -> 변수 설정
	//2. 조건 / 작업에 대한 분석을 진행
	//	소득액 입력
	//	과세 표준에 따른 세율 설정
	//	세율을 통해 세금 계산
	
	//★문제 풀 때 필요한 요소(수학 공식, 알고리즘 등등)
	//이 문제에서 사용할 개념 : 백분율
	//ex) 0.06 -> 6%
	//2.34 -> 234%
	//세금 계산식 : 소득액 * 백분율

	float income, tax_rate, tax; //변수 선언시에는 콤마로 여러 개 선언 가능(같은 형식)

	printf("2024년 소득액을 작성해주세요.(만원 단위) >>");
	scanf("%f", &income);
	//scanf("서식", &변수명); 을 통해 작성할 수 있음

	//과세 표준에 따른 세율 설정
	if (income <= 1200)
	{
		tax_rate = 0.06;
	}
	else if (income <= 4600) //위에 있는 1200만원 이하라는 조건의 else, 즉 1200만원 초과라는 조건이 숨어 있는 거야
	//1200 < income <= 4600
	{
		tax_rate = 0.15f;
	}
	else if (income <= 8800)
	{
		tax_rate = 0.24f;
	}

	tax = income * tax_rate;
	printf("세율은 %.0f%%입니다.\n", tax_rate * 100);
	printf("지불하실 금액은 %.0f(만원)입니다.\n", tax);

	return 0;
}